BRAILLE_MAP = {
    'a':'⠁','b':'⠃','c':'⠉','d':'⠙','e':'⠑',
    'f':'⠋','g':'⠛','h':'⠓','i':'⠊','j':'⠚',
    'k':'⠅','l':'⠇','m':'⠍','n':'⠝','o':'⠕',
    'p':'⠏','q':'⠟','r':'⠗','s':'⠎','t':'⠞',
    'u':'⠥','v':'⠧','w':'⠺','x':'⠭','y':'⠽','z':'⠵',
    ' ':' '
}

HINDI_MAP = {
    'अ':'⠁','आ':'⠜','इ':'⠊','ई':'⠔','उ':'⠥','ऊ':'⠳',
    'ए':'⠢','ओ':'⠕','क':'⠅','ग':'⠛','च':'⠉','ज':'⠚',
    'त':'⠞','द':'⠙','न':'⠝','प':'⠏','ब':'⠃','म':'⠍',
    'य':'⠽','र':'⠗','ल':'⠇','व':'⠧','स':'⠎','ह':'⠓',
    ' ':' ','।':'⠲'
}

def is_hindi(text):
    return any('\u0900' <= c <= '\u097F' for c in text)

def to_braille(text):
    if is_hindi(text):
        return "".join(HINDI_MAP.get(c, '⣿') for c in text)
    return "".join(BRAILLE_MAP.get(c.lower(), '⣿') for c in text)
